/*
 БОЛЬШАЯ- О (асимптотика)
 - описывает время выполнения алгоритма при худшем варианте (когда нужно перебрать все элементы n)
 - скорость алгоритмов измеряется не в секундах, а в темпе роста количества операций (на вколько быстро возрастает время выполнения алгоритма при увеличении количества входных данных)
 - О- большое игнорирует  числа, задейтвованные в операциях сложения, вычитания, умножения, деления
 
 ТИПИЧНЫЕ ПРИМЕРЫ О-большого:
 - О(log n) - логарифмическое время (бинарный поиск).
 - О(n) - линейное время (простой поиск).
 - О(n * log n) - линейно-логарифмическое время (квазилогарифмическое) (эффективные алгоритмы сортировки - быстрая сортировка, сортировка слиянием)
 - О(n^2) - квадратичное время (медленные алгоритмы сортировки - сортировка выбором, сортировака вставками, пузырьковая сортировка)
 - О(n!) - факториальное время (очень медленные сортировки - задача о коммивояжере)
 
 
 */
